zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp253cxx_cm0.h
#define DMA_SECCFGR_SEC0_Pos     (0U)
#define DMA_SECCFGR_SEC0_Msk     (0x1UL << DMA_SECCFGR_SEC0_Pos)                /*!< 0x00000001 */
#define DMA_SECCFGR_SEC0         DMA_SECCFGR_SEC0_Msk                          /*!< Secure State of Channel 0 */
#define DMA_SECCFGR_SEC1_Pos     (1U)
#define DMA_SECCFGR_SEC1_Msk     (0x1UL << DMA_SECCFGR_SEC1_Pos)                /*!< 0x00000002 */
#define DMA_SECCFGR_SEC1         DMA_SECCFGR_SEC1_Msk                          /*!< Secure State of Channel 1 */
#define DMA_SECCFGR_SEC2_Pos     (2U)
#define DMA_SECCFGR_SEC2_Msk     (0x1UL << DMA_SECCFGR_SEC2_Pos)                /*!< 0x00000004 */
#define DMA_SECCFGR_SEC2         DMA_SECCFGR_SEC2_Msk                          /*!< Secure State of Channel 2 */
#define DMA_SECCFGR_SEC3_Pos     (3U)
#define DMA_SECCFGR_SEC3_Msk     (0x1UL << DMA_SECCFGR_SEC3_Pos)                /*!< 0x00000008 */
#define DMA_SECCFGR_SEC3         DMA_SECCFGR_SEC3_Msk                          /*!< Secure State of Channel 3 */
#define DMA_SECCFGR_SEC4_Pos     (4U)
#define DMA_SECCFGR_SEC4_Msk     (0x1UL << DMA_SECCFGR_SEC4_Pos)                /*!< 0x00000010 */
#define DMA_SECCFGR_SEC4         DMA_SECCFGR_SEC4_Msk                          /*!< Secure State of Channel 4 */
#define DMA_SECCFGR_SEC5_Pos     (5U)
#define DMA_SECCFGR_SEC5_Msk     (0x1UL << DMA_SECCFGR_SEC5_Pos)                /*!< 0x00000020 */
#define DMA_SECCFGR_SEC5         DMA_SECCFGR_SEC5_Msk                          /*!< Secure State of Channel 5 */
#define DMA_SECCFGR_SEC6_Pos     (6U)
#define DMA_SECCFGR_SEC6_Msk     (0x1UL << DMA_SECCFGR_SEC6_Pos)                /*!< 0x00000040 */
#define DMA_SECCFGR_SEC6         DMA_SECCFGR_SEC6_Msk                          /*!< Secure State of Channel 6 */
#define DMA_SECCFGR_SEC7_Pos     (7U)
#define DMA_SECCFGR_SEC7_Msk     (0x1UL << DMA_SECCFGR_SEC7_Pos)                /*!< 0x00000080 */
#define DMA_SECCFGR_SEC7         DMA_SECCFGR_SEC7_Msk                          /*!< Secure State of Channel 7 */
#define DMA_SECCFGR_SEC8_Pos     (8U)
#define DMA_SECCFGR_SEC8_Msk     (0x1UL << DMA_SECCFGR_SEC8_Pos)                /*!< 0x00000100 */
#define DMA_SECCFGR_SEC8         DMA_SECCFGR_SEC8_Msk                          /*!< Secure State of Channel 8 */
#define DMA_SECCFGR_SEC9_Pos     (9U)
#define DMA_SECCFGR_SEC9_Msk     (0x1UL << DMA_SECCFGR_SEC9_Pos)                /*!< 0x00000200 */
#define DMA_SECCFGR_SEC9         DMA_SECCFGR_SEC9_Msk                          /*!< Secure State of Channel 9 */
#define DMA_SECCFGR_SEC10_Pos    (10U)
#define DMA_SECCFGR_SEC10_Msk    (0x1UL << DMA_SECCFGR_SEC10_Pos)               /*!< 0x00000400 */
#define DMA_SECCFGR_SEC10        DMA_SECCFGR_SEC10_Msk                         /*!< Secure State of Channel 10 */
#define DMA_SECCFGR_SEC11_Pos    (11U)
#define DMA_SECCFGR_SEC11_Msk    (0x1UL << DMA_SECCFGR_SEC11_Pos)               /*!< 0x00000800 */
#define DMA_SECCFGR_SEC11        DMA_SECCFGR_SEC11_Msk                         /*!< Secure State of Channel 11 */
#define DMA_SECCFGR_SEC12_Pos    (12U)
#define DMA_SECCFGR_SEC12_Msk    (0x1UL << DMA_SECCFGR_SEC12_Pos)               /*!< 0x00001000 */
#define DMA_SECCFGR_SEC12        DMA_SECCFGR_SEC12_Msk                         /*!< Secure State of Channel 12 */
#define DMA_SECCFGR_SEC13_Pos    (13U)
#define DMA_SECCFGR_SEC13_Msk    (0x1UL << DMA_SECCFGR_SEC13_Pos)               /*!< 0x00002000 */
#define DMA_SECCFGR_SEC13        DMA_SECCFGR_SEC13_Msk                         /*!< Secure State of Channel 13 */
#define DMA_SECCFGR_SEC14_Pos    (14U)
#define DMA_SECCFGR_SEC14_Msk    (0x1UL << DMA_SECCFGR_SEC14_Pos)               /*!< 0x00004000 */
#define DMA_SECCFGR_SEC14        DMA_SECCFGR_SEC14_Msk                         /*!< Secure State of Channel 14 */
#define DMA_SECCFGR_SEC15_Pos    (15U)
#define DMA_SECCFGR_SEC15_Msk    (0x1UL << DMA_SECCFGR_SEC15_Pos)               /*!< 0x00008000 */
#define DMA_SECCFGR_SEC15        DMA_SECCFGR_SEC14_Msk                         /*!< Secure State of Channel 15 */

/*******************  Bit definition for DMA_PRIVCFGR register  ****************/
#define DMA_PRIVCFGR_PRIV0_Pos   (0U)
#define DMA_PRIVCFGR_PRIV0_Msk   (0x1UL << DMA_PRIVCFGR_PRIV0_Pos)              /*!< 0x00000001 */
#define DMA_PRIVCFGR_PRIV0       DMA_PRIVCFGR_PRIV0_Msk                        /*!< Privileged State of Channel 0 */
#define DMA_PRIVCFGR_PRIV1_Pos   (1U)
#define DMA_PRIVCFGR_PRIV1_Msk   (0x1UL << DMA_PRIVCFGR_PRIV1_Pos)              /*!< 0x00000002 */
#define DMA_PRIVCFGR_PRIV1       DMA_PRIVCFGR_PRIV1_Msk                        /*!< Privileged State of Channel 1 */
#define DMA_PRIVCFGR_PRIV2_Pos   (2U)
#define DMA_PRIVCFGR_PRIV2_Msk   (0x1UL << DMA_PRIVCFGR_PRIV2_Pos)              /*!< 0x00000004 */
#define DMA_PRIVCFGR_PRIV2       DMA_PRIVCFGR_PRIV2_Msk                        /*!< Privileged State of Channel 2 */
#define DMA_PRIVCFGR_PRIV3_Pos   (3U)
#define DMA_PRIVCFGR_PRIV3_Msk   (0x1UL << DMA_PRIVCFGR_PRIV3_Pos)              /*!< 0x00000008 */
#define DMA_PRIVCFGR_PRIV3       DMA_PRIVCFGR_PRIV3_Msk                        /*!< Privileged State of Channel 3 */
#define DMA_PRIVCFGR_PRIV4_Pos   (4U)
#define DMA_PRIVCFGR_PRIV4_Msk   (0x1UL << DMA_PRIVCFGR_PRIV4_Pos)              /*!< 0x00000010 */
#define DMA_PRIVCFGR_PRIV4       DMA_PRIVCFGR_PRIV4_Msk                        /*!< Privileged State of Channel 4 */
#define DMA_PRIVCFGR_PRIV5_Pos   (5U)
#define DMA_PRIVCFGR_PRIV5_Msk   (0x1UL << DMA_PRIVCFGR_PRIV5_Pos)              /*!< 0x00000020 */
#define DMA_PRIVCFGR_PRIV5       DMA_PRIVCFGR_PRIV5_Msk                        /*!< Privileged State of Channel 5 */
#define DMA_PRIVCFGR_PRIV6_Pos   (6U)
#define DMA_PRIVCFGR_PRIV6_Msk   (0x1UL << DMA_PRIVCFGR_PRIV6_Pos)              /*!< 0x00000040 */
#define DMA_PRIVCFGR_PRIV6       DMA_PRIVCFGR_PRIV6_Msk                        /*!< Privileged State of Channel 6 */
#define DMA_PRIVCFGR_PRIV7_Pos   (7U)
#define DMA_PRIVCFGR_PRIV7_Msk   (0x1UL << DMA_PRIVCFGR_PRIV7_Pos)              /*!< 0x00000080 */
#define DMA_PRIVCFGR_PRIV7       DMA_PRIVCFGR_PRIV7_Msk                        /*!< Privileged State of Channel 7 */
#define DMA_PRIVCFGR_PRIV8_Pos   (8U)
#define DMA_PRIVCFGR_PRIV8_Msk   (0x1UL << DMA_PRIVCFGR_PRIV8_Pos)              /*!< 0x00000100 */
#define DMA_PRIVCFGR_PRIV8       DMA_PRIVCFGR_PRIV8_Msk                        /*!< Privileged State of Channel 8 */
#define DMA_PRIVCFGR_PRIV9_Pos   (9U)
#define DMA_PRIVCFGR_PRIV9_Msk   (0x1UL << DMA_PRIVCFGR_PRIV9_Pos)              /*!< 0x00000200 */
#define DMA_PRIVCFGR_PRIV9       DMA_PRIVCFGR_PRIV9_Msk                        /*!< Privileged State of Channel 9 */
#define DMA_PRIVCFGR_PRIV10_Pos  (10U)
#define DMA_PRIVCFGR_PRIV10_Msk  (0x1UL << DMA_PRIVCFGR_PRIV10_Pos)             /*!< 0x00000400 */
#define DMA_PRIVCFGR_PRIV10      DMA_PRIVCFGR_PRIV10_Msk                       /*!< Privileged State of Channel 10 */
#define DMA_PRIVCFGR_PRIV11_Pos  (11U)
#define DMA_PRIVCFGR_PRIV11_Msk  (0x1UL << DMA_PRIVCFGR_PRIV11_Pos)             /*!< 0x00000800 */
#define DMA_PRIVCFGR_PRIV11      DMA_PRIVCFGR_PRIV11_Msk                       /*!< Privileged State of Channel 11 */
#define DMA_PRIVCFGR_PRIV12_Pos  (12U)
#define DMA_PRIVCFGR_PRIV12_Msk  (0x1UL << DMA_PRIVCFGR_PRIV12_Pos)             /*!< 0x00001000 */
#define DMA_PRIVCFGR_PRIV12      DMA_PRIVCFGR_PRIV12_Msk                       /*!< Privileged State of Channel 12 */
#define DMA_PRIVCFGR_PRIV13_Pos  (13U)
#define DMA_PRIVCFGR_PRIV13_Msk  (0x1UL << DMA_PRIVCFGR_PRIV13_Pos)             /*!< 0x00002000 */
#define DMA_PRIVCFGR_PRIV13      DMA_PRIVCFGR_PRIV13_Msk                       /*!< Privileged State of Channel 13 */
#define DMA_PRIVCFGR_PRIV14_Pos  (14U)
#define DMA_PRIVCFGR_PRIV14_Msk  (0x1UL << DMA_PRIVCFGR_PRIV14_Pos)             /*!< 0x00004000 */
#define DMA_PRIVCFGR_PRIV14      DMA_PRIVCFGR_PRIV14_Msk                       /*!< Privileged State of Channel 14 */
#define DMA_PRIVCFGR_PRIV15_Pos  (15U)
#define DMA_PRIVCFGR_PRIV15_Msk  (0x1UL << DMA_PRIVCFGR_PRIV15_Pos)             /*!< 0x00008000 */
#define DMA_PRIVCFGR_PRIV15      DMA_PRIVCFGR_PRIV15_Msk                       /*!< Privileged State of Channel 15 */

