zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp253cxx_cm0.h
/* Bit fields for PWR_CPU2D2SR register */
#define PWR_CPU2D2SR_HOLD_BOOT_Pos             (0U)
#define PWR_CPU2D2SR_HOLD_BOOT_Msk             (0x1UL << PWR_CPU2D2SR_HOLD_BOOT_Pos)
#define PWR_CPU2D2SR_HOLD_BOOT                 PWR_CPU2D2SR_HOLD_BOOT_Msk  /*!< CPU2 HOLD_BOOT status flag.Set by hardware to indicate when the CPU2 is in HOLD_BOOT state.- 0: CPU2 is allowed to boot.- 1: CPU2 is maintained in HOLD_BOOT state by hardware.Refer to RCC specification for details on HOLD_BOOT processor state. */
#define PWR_CPU2D2SR_WFBEN_Pos                 (1U)
#define PWR_CPU2D2SR_WFBEN_Msk                 (0x1UL << PWR_CPU2D2SR_WFBEN_Pos)
#define PWR_CPU2D2SR_WFBEN                     PWR_CPU2D2SR_WFBEN_Msk  /*!< CPU2 Wait for boot enable status flag.Set by hardware to indicate when the CPU2 is in wait for boot enable state. Only applicable in Wakeup event mode.- 0: CPU2 is not in wait for boot enable state. Set at â0â in legacy boot mode.- 1: CPU2 is in wait for boot enable state. It will start once an event assign to him will be raised.Refer to RCC specification for details on HOLD_BOOT processor state. */
#define PWR_CPU2D2SR_CSTATE_Pos                (2U)
#define PWR_CPU2D2SR_CSTATE_Msk                (0x3UL << PWR_CPU2D2SR_CSTATE_Pos)
#define PWR_CPU2D2SR_CSTATE                    PWR_CPU2D2SR_CSTATE_Msk  /*!< CPU2 cluster state status flag.Set by hardware to indicate when the CPU2 is in CRun, CSleep or CStop states.- 00: CPU2 is in reset (Hold_boot or Wfben).- 01: CPU2 is in CRun state.- 10: CPU2 is in CSleep state.- 11: CPU2 is in CStop state. */
#define PWR_CPU2D2SR_DSTATE_Pos                (8U)
#define PWR_CPU2D2SR_DSTATE_Msk                (0x7UL << PWR_CPU2D2SR_DSTATE_Pos)
#define PWR_CPU2D2SR_DSTATE                    PWR_CPU2D2SR_DSTATE_Msk  /*!< System / D2 state status.Set by hardware to indicate when the system / D2 domain is in Run, Stop, LP-Stop, LPLV-Stop, Standby and VBAT modes.- 000: Run- 001: Stop- 010: LP-Stop- 011: LPLV-Stop- 100: Standby- 101: VBAT */

/* Bit fields for PWR_CPU3D3SR register */
#define PWR_CPU3D3SR_CSTATE_Pos                (2U)
#define PWR_CPU3D3SR_CSTATE_Msk                (0x3UL << PWR_CPU3D3SR_CSTATE_Pos)
#define PWR_CPU3D3SR_CSTATE                    PWR_CPU3D3SR_CSTATE_Msk  /*!< CPU3 cluster state status flag.Set by hardware to indicate when the CPU3 is in CRun, CSleep or CStop states.- 00: CPU3 is in reset.- 01: CPU3 is in CRun state.- 10: CPU3 is in CSleep state.- 11: CPU3 is in CStop state. */
#define PWR_CPU3D3SR_DSTATE_Pos                (8U)
#define PWR_CPU3D3SR_DSTATE_Msk                (0x7UL << PWR_CPU3D3SR_DSTATE_Pos)
#define PWR_CPU3D3SR_DSTATE                    PWR_CPU3D3SR_DSTATE_Msk  /*!< D3 state status.Set by hardware to indicate when the D3 domain is in SRun1/2/3, SStop1/2 and SStandby modes.- 000: SRun1- 001: SRun2- 010: SRun3- 011: SStop1- 100: SStop2- 101: SStandby (only accessible in Debug standby mode) */

/* Bit fields for PWR_VERR register */
#define PWR_VERR_MINREV_Pos                    (0U)
#define PWR_VERR_MINREV_Msk                    (0xfUL << PWR_VERR_MINREV_Pos)
#define PWR_VERR_MINREV                        PWR_VERR_MINREV_Msk  /*!< Minor revision number. */
#define PWR_VERR_MAJREV_Pos                    (4U)
#define PWR_VERR_MAJREV_Msk                    (0xfUL << PWR_VERR_MAJREV_Pos)
#define PWR_VERR_MAJREV                        PWR_VERR_MAJREV_Msk  /*!< Major revision number. */

/* Bit fields for PWR_IPIDR register */
#define PWR_IPIDR_ID_Pos                       (0U)
#define PWR_IPIDR_ID_Msk                       (0xffffffffUL << PWR_IPIDR_ID_Pos)
#define PWR_IPIDR_ID                           PWR_IPIDR_ID_Msk  /*!< Identifier of the PWR */

/* Bit fields for PWR_SIDR register */
#define PWR_SIDR_SID_Pos                       (0U)
#define PWR_SIDR_SID_Msk                       (0xffffffffUL << PWR_SIDR_SID_Pos)
#define PWR_SIDR_SID                           PWR_SIDR_SID_Msk  /*!< Decoding space is 1 KB */

/******************************************************************************/
/*                                                                            */
/*                                    RIF                                     */
/*                            (RIF User Spec Rev 1.0.14)                      */
/******************************************************************************/
#define  RIF_CID_CPU1_CA35 0x1U
#define  RIF_CID_CPU2_CM33 0x2U
#define  RIF_CID_CPU3_CM0  0x3U

/*******************  Bits definition for RISC_CR register ********************/
#define RISC_CR_GLOCK_Pos             (0U)
#define RISC_CR_GLOCK_Msk             (0x1UL << RISC_CR_GLOCK_Pos)               /*!< 0x00000001 */
#define RISC_CR_GLOCK                 RISC_CR_GLOCK_Msk

/*******************  Bits definition for RISC_SECCFGR0 register **************/
#define RISC_SECCFGR0_SEC0_Pos        (0U)
#define RISC_SECCFGR0_SEC0_Msk        (0x1UL << RISC_SECCFGR0_SEC0_Pos)          /*!< 0x00000001 */
#define RISC_SECCFGR0_SEC0            RISC_SECCFGR0_SEC0_Msk
#define RISC_SECCFGR0_SEC1_Pos        (1U)
#define RISC_SECCFGR0_SEC1_Msk        (0x1UL << RISC_SECCFGR0_SEC1_Pos)          /*!< 0x00000002 */
#define RISC_SECCFGR0_SEC1            RISC_SECCFGR0_SEC1_Msk
#define RISC_SECCFGR0_SEC2_Pos        (2U)
#define RISC_SECCFGR0_SEC2_Msk        (0x1UL << RISC_SECCFGR0_SEC2_Pos)          /*!< 0x00000004 */
#define RISC_SECCFGR0_SEC2            RISC_SECCFGR0_SEC2_Msk
#define RISC_SECCFGR0_SEC3_Pos        (3U)
#define RISC_SECCFGR0_SEC3_Msk        (0x1UL << RISC_SECCFGR0_SEC3_Pos)          /*!< 0x00000008 */
#define RISC_SECCFGR0_SEC3            RISC_SECCFGR0_SEC3_Msk
#define RISC_SECCFGR0_SEC4_Pos        (4U)
#define RISC_SECCFGR0_SEC4_Msk        (0x1UL << RISC_SECCFGR0_SEC4_Pos)          /*!< 0x00000010 */
#define RISC_SECCFGR0_SEC4            RISC_SECCFGR0_SEC4_Msk
#define RISC_SECCFGR0_SEC5_Pos        (5U)
#define RISC_SECCFGR0_SEC5_Msk        (0x1UL << RISC_SECCFGR0_SEC5_Pos)          /*!< 0x00000020 */
#define RISC_SECCFGR0_SEC5            RISC_SECCFGR0_SEC5_Msk
#define RISC_SECCFGR0_SEC6_Pos        (6U)
#define RISC_SECCFGR0_SEC6_Msk        (0x1UL << RISC_SECCFGR0_SEC6_Pos)          /*!< 0x00000040 */
#define RISC_SECCFGR0_SEC6            RISC_SECCFGR0_SEC6_Msk
#define RISC_SECCFGR0_SEC7_Pos        (7U)
#define RISC_SECCFGR0_SEC7_Msk        (0x1UL << RISC_SECCFGR0_SEC7_Pos)          /*!< 0x00000080 */
#define RISC_SECCFGR0_SEC7            RISC_SECCFGR0_SEC7_Msk
#define RISC_SECCFGR0_SEC8_Pos        (8U)
#define RISC_SECCFGR0_SEC8_Msk        (0x1UL << RISC_SECCFGR0_SEC8_Pos)          /*!< 0x00000100 */
#define RISC_SECCFGR0_SEC8            RISC_SECCFGR0_SEC8_Msk
#define RISC_SECCFGR0_SEC9_Pos        (9U)
#define RISC_SECCFGR0_SEC9_Msk        (0x1UL << RISC_SECCFGR0_SEC9_Pos)          /*!< 0x00000200 */
#define RISC_SECCFGR0_SEC9            RISC_SECCFGR0_SEC9_Msk
#define RISC_SECCFGR0_SEC10_Pos       (10U)
#define RISC_SECCFGR0_SEC10_Msk       (0x1UL << RISC_SECCFGR0_SEC10_Pos)         /*!< 0x00000400 */
#define RISC_SECCFGR0_SEC10           RISC_SECCFGR0_SEC10_Msk
#define RISC_SECCFGR0_SEC11_Pos       (11U)
#define RISC_SECCFGR0_SEC11_Msk       (0x1UL << RISC_SECCFGR0_SEC11_Pos)         /*!< 0x00000800 */
#define RISC_SECCFGR0_SEC11           RISC_SECCFGR0_SEC11_Msk
#define RISC_SECCFGR0_SEC12_Pos       (12U)
#define RISC_SECCFGR0_SEC12_Msk       (0x1UL << RISC_SECCFGR0_SEC12_Pos)         /*!< 0x00001000 */
#define RISC_SECCFGR0_SEC12           RISC_SECCFGR0_SEC12_Msk
#define RISC_SECCFGR0_SEC13_Pos       (13U)
#define RISC_SECCFGR0_SEC13_Msk       (0x1UL << RISC_SECCFGR0_SEC13_Pos)         /*!< 0x00002000 */
#define RISC_SECCFGR0_SEC13           RISC_SECCFGR0_SEC13_Msk
#define RISC_SECCFGR0_SEC14_Pos       (14U)
#define RISC_SECCFGR0_SEC14_Msk       (0x1UL << RISC_SECCFGR0_SEC14_Pos)         /*!< 0x00004000 */
#define RISC_SECCFGR0_SEC14           RISC_SECCFGR0_SEC14_Msk
#define RISC_SECCFGR0_SEC15_Pos       (15U)
#define RISC_SECCFGR0_SEC15_Msk       (0x1UL << RISC_SECCFGR0_SEC15_Pos)         /*!< 0x00008000 */
#define RISC_SECCFGR0_SEC15           RISC_SECCFGR0_SEC15_Msk
#define RISC_SECCFGR0_SEC16_Pos       (16U)
#define RISC_SECCFGR0_SEC16_Msk       (0x1UL << RISC_SECCFGR0_SEC16_Pos)         /*!< 0x00010000 */
#define RISC_SECCFGR0_SEC16           RISC_SECCFGR0_SEC16_Msk
#define RISC_SECCFGR0_SEC17_Pos       (17U)
#define RISC_SECCFGR0_SEC17_Msk       (0x1UL << RISC_SECCFGR0_SEC17_Pos)         /*!< 0x00020000 */
#define RISC_SECCFGR0_SEC17           RISC_SECCFGR0_SEC17_Msk
#define RISC_SECCFGR0_SEC18_Pos       (18U)
#define RISC_SECCFGR0_SEC18_Msk       (0x1UL << RISC_SECCFGR0_SEC18_Pos)         /*!< 0x00040000 */
#define RISC_SECCFGR0_SEC18           RISC_SECCFGR0_SEC18_Msk
#define RISC_SECCFGR0_SEC19_Pos       (19U)
#define RISC_SECCFGR0_SEC19_Msk       (0x1UL << RISC_SECCFGR0_SEC19_Pos)         /*!< 0x00080000 */
#define RISC_SECCFGR0_SEC19           RISC_SECCFGR0_SEC19_Msk
#define RISC_SECCFGR0_SEC20_Pos       (20U)
#define RISC_SECCFGR0_SEC20_Msk       (0x1UL << RISC_SECCFGR0_SEC20_Pos)         /*!< 0x00100000 */
#define RISC_SECCFGR0_SEC20           RISC_SECCFGR0_SEC20_Msk
#define RISC_SECCFGR0_SEC21_Pos       (21U)
#define RISC_SECCFGR0_SEC21_Msk       (0x1UL << RISC_SECCFGR0_SEC21_Pos)         /*!< 0x00200000 */
#define RISC_SECCFGR0_SEC21           RISC_SECCFGR0_SEC21_Msk
#define RISC_SECCFGR0_SEC22_Pos       (22U)
#define RISC_SECCFGR0_SEC22_Msk       (0x1UL << RISC_SECCFGR0_SEC22_Pos)         /*!< 0x00400000 */
#define RISC_SECCFGR0_SEC22           RISC_SECCFGR0_SEC22_Msk
#define RISC_SECCFGR0_SEC23_Pos       (23U)
#define RISC_SECCFGR0_SEC23_Msk       (0x1UL << RISC_SECCFGR0_SEC23_Pos)         /*!< 0x00800000 */
#define RISC_SECCFGR0_SEC23           RISC_SECCFGR0_SEC23_Msk
#define RISC_SECCFGR0_SEC24_Pos       (24U)
#define RISC_SECCFGR0_SEC24_Msk       (0x1UL << RISC_SECCFGR0_SEC24_Pos)         /*!< 0x01000000 */
#define RISC_SECCFGR0_SEC24           RISC_SECCFGR0_SEC24_Msk
#define RISC_SECCFGR0_SEC25_Pos       (25U)
#define RISC_SECCFGR0_SEC25_Msk       (0x1UL << RISC_SECCFGR0_SEC25_Pos)         /*!< 0x02000000 */
#define RISC_SECCFGR0_SEC25           RISC_SECCFGR0_SEC25_Msk
#define RISC_SECCFGR0_SEC26_Pos       (26U)
#define RISC_SECCFGR0_SEC26_Msk       (0x1UL << RISC_SECCFGR0_SEC26_Pos)         /*!< 0x04000000 */
#define RISC_SECCFGR0_SEC26           RISC_SECCFGR0_SEC26_Msk
#define RISC_SECCFGR0_SEC27_Pos       (27U)
#define RISC_SECCFGR0_SEC27_Msk       (0x1UL << RISC_SECCFGR0_SEC27_Pos)         /*!< 0x08000000 */
#define RISC_SECCFGR0_SEC27           RISC_SECCFGR0_SEC27_Msk
#define RISC_SECCFGR0_SEC28_Pos       (28U)
#define RISC_SECCFGR0_SEC28_Msk       (0x1UL << RISC_SECCFGR0_SEC28_Pos)         /*!< 0x10000000 */
#define RISC_SECCFGR0_SEC28           RISC_SECCFGR0_SEC28_Msk
#define RISC_SECCFGR0_SEC29_Pos       (29U)
#define RISC_SECCFGR0_SEC29_Msk       (0x1UL << RISC_SECCFGR0_SEC29_Pos)         /*!< 0x20000000 */
#define RISC_SECCFGR0_SEC29           RISC_SECCFGR0_SEC29_Msk
#define RISC_SECCFGR0_SEC30_Pos       (30U)
#define RISC_SECCFGR0_SEC30_Msk       (0x1UL << RISC_SECCFGR0_SEC30_Pos)         /*!< 0x40000000 */
#define RISC_SECCFGR0_SEC30           RISC_SECCFGR0_SEC30_Msk
#define RISC_SECCFGR0_SEC31_Pos       (31U)
#define RISC_SECCFGR0_SEC31_Msk       (0x1UL << RISC_SECCFGR0_SEC31_Pos)         /*!< 0x80000000 */
#define RISC_SECCFGR0_SEC31           RISC_SECCFGR0_SEC31_Msk

/*******************  Bits definition for RISC_SECCFGR1 register **************/
#define RISC_SECCFGR1_SEC32_Pos       (0U)
#define RISC_SECCFGR1_SEC32_Msk       (0x1UL << RISC_SECCFGR1_SEC32_Pos)         /*!< 0x00000001 */
#define RISC_SECCFGR1_SEC32           RISC_SECCFGR1_SEC32_Msk
#define RISC_SECCFGR1_SEC33_Pos       (1U)
#define RISC_SECCFGR1_SEC33_Msk       (0x1UL << RISC_SECCFGR1_SEC33_Pos)         /*!< 0x00000002 */
#define RISC_SECCFGR1_SEC33           RISC_SECCFGR1_SEC33_Msk
#define RISC_SECCFGR1_SEC34_Pos       (2U)
#define RISC_SECCFGR1_SEC34_Msk       (0x1UL << RISC_SECCFGR1_SEC34_Pos)         /*!< 0x00000004 */
#define RISC_SECCFGR1_SEC34           RISC_SECCFGR1_SEC34_Msk
#define RISC_SECCFGR1_SEC35_Pos       (3U)
#define RISC_SECCFGR1_SEC35_Msk       (0x1UL << RISC_SECCFGR1_SEC35_Pos)         /*!< 0x00000008 */
#define RISC_SECCFGR1_SEC35           RISC_SECCFGR1_SEC35_Msk
#define RISC_SECCFGR1_SEC36_Pos       (4U)
#define RISC_SECCFGR1_SEC36_Msk       (0x1UL << RISC_SECCFGR1_SEC36_Pos)         /*!< 0x00000010 */
#define RISC_SECCFGR1_SEC36           RISC_SECCFGR1_SEC36_Msk
#define RISC_SECCFGR1_SEC37_Pos       (5U)
#define RISC_SECCFGR1_SEC37_Msk       (0x1UL << RISC_SECCFGR1_SEC37_Pos)         /*!< 0x00000020 */
#define RISC_SECCFGR1_SEC37           RISC_SECCFGR1_SEC37_Msk
#define RISC_SECCFGR1_SEC38_Pos       (6U)
#define RISC_SECCFGR1_SEC38_Msk       (0x1UL << RISC_SECCFGR1_SEC38_Pos)         /*!< 0x00000040 */
#define RISC_SECCFGR1_SEC38           RISC_SECCFGR1_SEC38_Msk
#define RISC_SECCFGR1_SEC39_Pos       (7U)
#define RISC_SECCFGR1_SEC39_Msk       (0x1UL << RISC_SECCFGR1_SEC39_Pos)         /*!< 0x00000080 */
#define RISC_SECCFGR1_SEC39           RISC_SECCFGR1_SEC39_Msk
#define RISC_SECCFGR1_SEC40_Pos       (8U)
#define RISC_SECCFGR1_SEC40_Msk       (0x1UL << RISC_SECCFGR1_SEC40_Pos)         /*!< 0x00000100 */
#define RISC_SECCFGR1_SEC40           RISC_SECCFGR1_SEC40_Msk
#define RISC_SECCFGR1_SEC41_Pos       (9U)
#define RISC_SECCFGR1_SEC41_Msk       (0x1UL << RISC_SECCFGR1_SEC41_Pos)         /*!< 0x00000200 */
#define RISC_SECCFGR1_SEC41           RISC_SECCFGR1_SEC41_Msk
#define RISC_SECCFGR1_SEC42_Pos       (10U)
#define RISC_SECCFGR1_SEC42_Msk       (0x1UL << RISC_SECCFGR1_SEC42_Pos)         /*!< 0x00000400 */
#define RISC_SECCFGR1_SEC42           RISC_SECCFGR1_SEC42_Msk
#define RISC_SECCFGR1_SEC43_Pos       (11U)
#define RISC_SECCFGR1_SEC43_Msk       (0x1UL << RISC_SECCFGR1_SEC43_Pos)         /*!< 0x00000800 */
#define RISC_SECCFGR1_SEC43           RISC_SECCFGR1_SEC43_Msk
#define RISC_SECCFGR1_SEC44_Pos       (12U)
#define RISC_SECCFGR1_SEC44_Msk       (0x1UL << RISC_SECCFGR1_SEC44_Pos)         /*!< 0x00001000 */
#define RISC_SECCFGR1_SEC44           RISC_SECCFGR1_SEC44_Msk
#define RISC_SECCFGR1_SEC45_Pos       (13U)
#define RISC_SECCFGR1_SEC45_Msk       (0x1UL << RISC_SECCFGR1_SEC45_Pos)         /*!< 0x00002000 */
#define RISC_SECCFGR1_SEC45           RISC_SECCFGR1_SEC45_Msk
#define RISC_SECCFGR1_SEC46_Pos       (14U)
#define RISC_SECCFGR1_SEC46_Msk       (0x1UL << RISC_SECCFGR1_SEC46_Pos)         /*!< 0x00004000 */
#define RISC_SECCFGR1_SEC46           RISC_SECCFGR1_SEC46_Msk
#define RISC_SECCFGR1_SEC47_Pos       (15U)
#define RISC_SECCFGR1_SEC47_Msk       (0x1UL << RISC_SECCFGR1_SEC47_Pos)         /*!< 0x00008000 */
#define RISC_SECCFGR1_SEC47           RISC_SECCFGR1_SEC47_Msk
#define RISC_SECCFGR1_SEC48_Pos       (16U)
#define RISC_SECCFGR1_SEC48_Msk       (0x1UL << RISC_SECCFGR1_SEC48_Pos)         /*!< 0x00010000 */
#define RISC_SECCFGR1_SEC48           RISC_SECCFGR1_SEC48_Msk
#define RISC_SECCFGR1_SEC49_Pos       (17U)
#define RISC_SECCFGR1_SEC49_Msk       (0x1UL << RISC_SECCFGR1_SEC49_Pos)         /*!< 0x00020000 */
#define RISC_SECCFGR1_SEC49           RISC_SECCFGR1_SEC49_Msk
#define RISC_SECCFGR1_SEC50_Pos       (18U)
#define RISC_SECCFGR1_SEC50_Msk       (0x1UL << RISC_SECCFGR1_SEC50_Pos)         /*!< 0x00040000 */
#define RISC_SECCFGR1_SEC50           RISC_SECCFGR1_SEC50_Msk
#define RISC_SECCFGR1_SEC51_Pos       (19U)
#define RISC_SECCFGR1_SEC51_Msk       (0x1UL << RISC_SECCFGR1_SEC51_Pos)         /*!< 0x00080000 */
#define RISC_SECCFGR1_SEC51           RISC_SECCFGR1_SEC51_Msk
#define RISC_SECCFGR1_SEC52_Pos       (20U)
#define RISC_SECCFGR1_SEC52_Msk       (0x1UL << RISC_SECCFGR1_SEC52_Pos)         /*!< 0x00100000 */
#define RISC_SECCFGR1_SEC52           RISC_SECCFGR1_SEC52_Msk
#define RISC_SECCFGR1_SEC53_Pos       (21U)
#define RISC_SECCFGR1_SEC53_Msk       (0x1UL << RISC_SECCFGR1_SEC53_Pos)         /*!< 0x00200000 */
#define RISC_SECCFGR1_SEC53           RISC_SECCFGR1_SEC53_Msk
#define RISC_SECCFGR1_SEC54_Pos       (22U)
#define RISC_SECCFGR1_SEC54_Msk       (0x1UL << RISC_SECCFGR1_SEC54_Pos)         /*!< 0x00400000 */
#define RISC_SECCFGR1_SEC54           RISC_SECCFGR1_SEC54_Msk
#define RISC_SECCFGR1_SEC55_Pos       (23U)
#define RISC_SECCFGR1_SEC55_Msk       (0x1UL << RISC_SECCFGR1_SEC55_Pos)         /*!< 0x00800000 */
#define RISC_SECCFGR1_SEC55           RISC_SECCFGR1_SEC55_Msk
#define RISC_SECCFGR1_SEC56_Pos       (24U)
#define RISC_SECCFGR1_SEC56_Msk       (0x1UL << RISC_SECCFGR1_SEC56_Pos)         /*!< 0x01000000 */
#define RISC_SECCFGR1_SEC56           RISC_SECCFGR1_SEC56_Msk
#define RISC_SECCFGR1_SEC57_Pos       (25U)
#define RISC_SECCFGR1_SEC57_Msk       (0x1UL << RISC_SECCFGR1_SEC57_Pos)         /*!< 0x02000000 */
#define RISC_SECCFGR1_SEC57           RISC_SECCFGR1_SEC57_Msk
#define RISC_SECCFGR1_SEC58_Pos       (26U)
#define RISC_SECCFGR1_SEC58_Msk       (0x1UL << RISC_SECCFGR1_SEC58_Pos)         /*!< 0x04000000 */
#define RISC_SECCFGR1_SEC58           RISC_SECCFGR1_SEC58_Msk
#define RISC_SECCFGR1_SEC59_Pos       (27U)
#define RISC_SECCFGR1_SEC59_Msk       (0x1UL << RISC_SECCFGR1_SEC59_Pos)         /*!< 0x08000000 */
#define RISC_SECCFGR1_SEC59           RISC_SECCFGR1_SEC59_Msk
#define RISC_SECCFGR1_SEC60_Pos       (28U)
#define RISC_SECCFGR1_SEC60_Msk       (0x1UL << RISC_SECCFGR1_SEC60_Pos)         /*!< 0x10000000 */
#define RISC_SECCFGR1_SEC60           RISC_SECCFGR1_SEC60_Msk
#define RISC_SECCFGR1_SEC61_Pos       (29U)
#define RISC_SECCFGR1_SEC61_Msk       (0x1UL << RISC_SECCFGR1_SEC61_Pos)         /*!< 0x20000000 */
#define RISC_SECCFGR1_SEC61           RISC_SECCFGR1_SEC61_Msk
#define RISC_SECCFGR1_SEC62_Pos       (30U)
#define RISC_SECCFGR1_SEC62_Msk       (0x1UL << RISC_SECCFGR1_SEC62_Pos)         /*!< 0x40000000 */
#define RISC_SECCFGR1_SEC62           RISC_SECCFGR1_SEC62_Msk
#define RISC_SECCFGR1_SEC63_Pos       (31U)
#define RISC_SECCFGR1_SEC63_Msk       (0x1UL << RISC_SECCFGR1_SEC63_Pos)         /*!< 0x80000000 */
#define RISC_SECCFGR1_SEC63           RISC_SECCFGR1_SEC63_Msk

