zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp253cxx_cm0.h
/*******************  Bits definition for RTC_CFGR register  ******************/
#define RTC_CFGR_OUT2_RMP_Pos        (0U)
#define RTC_CFGR_OUT2_RMP_Msk        (0x1UL << RTC_CFGR_OUT2_RMP_Pos)                    /*!< 0x00000001 */
#define RTC_CFGR_OUT2_RMP            RTC_CFGR_OUT2_RMP_Msk

/********************  Bits definition for RTC_ALRABINR register  ******************/
#define RTC_ALRABINR_SS_Pos          (0U)
#define RTC_ALRABINR_SS_Msk          (0xFFFFFFFFUL << RTC_ALRABINR_SS_Pos)              /*!< 0xFFFFFFFF */
#define RTC_ALRABINR_SS              RTC_ALRABINR_SS_Msk

/********************  Bits definition for RTC_ALRBBINR register  ******************/
#define RTC_ALRBBINR_SS_Pos          (0U)
#define RTC_ALRBBINR_SS_Msk          (0xFFFFFFFFUL << RTC_ALRBBINR_SS_Pos)              /*!< 0xFFFFFFFF */
#define RTC_ALRBBINR_SS              RTC_ALRBBINR_SS_Msk

/********************  Bits definition for RTC_RCIDCFGR register  ******************/
#define RTC_RCIDCFGR_CFEN_Pos          (0U)
#define RTC_RCIDCFGR_CFEN_Msk          (0x1UL << RTC_RCIDCFGR_CFEN_Pos)                 /*!< 0xFFFFFFFF */
#define RTC_RCIDCFGR_CFEN              RTC_RCIDCFGR_CFEN_Msk
#define RTC_RCIDCFGR_CID_Pos           (4U)
#define RTC_RCIDCFGR_CID_Msk           (0xFUL << RTC_RCIDCFGR_CID_Pos)                  /*!< 0x000000F0 */
#define RTC_RCIDCFGR_CID               RTC_RCIDCFGR_CID_Msk

/********************  Bits definition for RTC_HWCFGR register  ******************/
#define RTC_HWCFGR_ALARMB_Pos          (0U)
#define RTC_HWCFGR_ALARMB_Msk          (0xFUL << RTC_HWCFGR_ALARMB_Pos)                 /*!< 0x0000000F */
#define RTC_HWCFGR_ALARMB              RTC_HWCFGR_ALARMB_Msk
#define RTC_HWCFGR_WAKEUP_Pos          (4U)
#define RTC_HWCFGR_WAKEUP_Msk          (0xFUL << RTC_HWCFGR_WAKEUP_Pos)                 /*!< 0x000000F0 */
#define RTC_HWCFGR_WAKEUP              RTC_HWCFGR_WAKEUP_Msk
#define RTC_HWCFGR_SMOOTH_CALIB_Pos    (8U)
#define RTC_HWCFGR_SMOOTH_CALIB_Msk    (0xFUL << RTC_HWCFGR_SMOOTH_CALIB_Pos)           /*!< 0x00000F00 */
#define RTC_HWCFGR_SMOOTH_CALIB        RTC_HWCFGR_SMOOTH_CALIB_Msk
#define RTC_HWCFGR_TIMESTAMP_Pos       (12U)
#define RTC_HWCFGR_TIMESTAMP_Msk       (0xFUL << RTC_HWCFGR_TIMESTAMP_Pos)              /*!< 0x00000F000 */
#define RTC_HWCFGR_TIMESTAMP           RTC_HWCFGR_TIMESTAMP_Msk
#define RTC_HWCFGR_OPTIONREG_OUT_Pos   (16U)
#define RTC_HWCFGR_OPTIONREG_OUT_Msk   (0xFFUL << RTC_HWCFGR_OPTIONREG_OUT_Pos)         /*!< 0x00FF0000 */
#define RTC_HWCFGR_OPTIONREG_OUT       RTC_HWCFGR_OPTIONREG_OUT_Msk
#define RTC_HWCFGR_TRUST_ZONE_Pos      (24U)
#define RTC_HWCFGR_TRUST_ZONE_Msk      (0xFUL << RTC_HWCFGR_TRUST_ZONE_Pos)             /*!< 0x0F000000 */
#define RTC_HWCFGR_TRUST_ZONE          RTC_HWCFGR_TRUST_ZONE_Msk
#define RTC_HWCFGR_RIF_Pos             (24U)
#define RTC_HWCFGR_RIF_Msk             (0xFUL << RTC_HWCFGR_RIF_Pos)                    /*!< 0xF0000000 */
#define RTC_HWCFGR_RIF                 RTC_HWCFGR_RIF_Msk

/*******************  Bits definition for RTC_VERR register  **************/
#define RTC_VERR_MINREV_Pos            (0U)
#define RTC_VERR_MINREV_Msk            (0x4UL << RTC_VERR_MINREV_Pos)                   /*!< 0x0000000F */
#define RTC_VERR_MINREV                RTC_VERR_MINREV_Msk                              /*!< RTC Minor version */
#define RTC_VERR_MAJREV_Pos            (4U)
#define RTC_VERR_MAJREV_Msk            (0x4UL << RTC_VERR_MAJREV_Pos)                   /*!< 0x000000F0 */
#define RTC_VERR_MAJREV                RTC_VERR_MAJREV_Msk                              /*!< RTC Major version */

/*******************  Bits definition for RTC_IPIDR register  **************/
#define RTC_IPIDR_ID_Pos               (0U)
#define RTC_IPIDR_ID_Msk               (0xFFFFFFFFUL << RTC_IPIDR_ID_Pos)               /*!< 0xFFFFFFFF */
#define RTC_IPIDR_ID                   RTC_IPIDR_ID_Msk                                 /*!< RTC ID */

/*******************  Bits definition for RTC_SIDR register  **************/
#define RTC_SIDR_SID_Pos               (0U)
#define RTC_SIDR_SID_Msk               (0xFFFFFFFFUL << RTC_SIDR_SID_Pos)               /*!< 0xFFFFFFFF */
#define RTC_SIDR_SID                   RTC_SIDR_SID_Msk                                 /*!< RTC Size ID */


/**********************************************************************************/
/*                                                                                */
/*     Serial Peripheral Interface and Integrated Interchip Sound  (SPI/I2S)      */
/*                                                                                */
/**********************************************************************************/
/********************  Bits definition for SPI_CR1 register      ******************/
#define SPI_CR1_SPE_Pos                     (0U)
#define SPI_CR1_SPE_Msk                     (0x1UL << SPI_CR1_SPE_Pos)              /*!< 0x00000001 */
#define SPI_CR1_SPE                         SPI_CR1_SPE_Msk                         /*!<Serial Peripheral Enable */
#define SPI_CR1_MASRX_Pos                   (8U)
#define SPI_CR1_MASRX_Msk                   (0x1UL << SPI_CR1_MASRX_Pos)            /*!< 0x00000100 */
#define SPI_CR1_MASRX                       SPI_CR1_MASRX_Msk                       /*!<Master automatic suspension in Receive mode */
#define SPI_CR1_CSTART_Pos                  (9U)
#define SPI_CR1_CSTART_Msk                  (0x1UL << SPI_CR1_CSTART_Pos)           /*!< 0x00000200 */
#define SPI_CR1_CSTART                      SPI_CR1_CSTART_Msk                      /*!<Master transfer start  */
#define SPI_CR1_CSUSP_Pos                   (10U)
#define SPI_CR1_CSUSP_Msk                   (0x1UL << SPI_CR1_CSUSP_Pos)            /*!< 0x00000400 */
#define SPI_CR1_CSUSP                       SPI_CR1_CSUSP_Msk                       /*!<Master SUSPend request */
#define SPI_CR1_HDDIR_Pos                   (11U)
#define SPI_CR1_HDDIR_Msk                   (0x1UL << SPI_CR1_HDDIR_Pos)            /*!< 0x00000800 */
#define SPI_CR1_HDDIR                       SPI_CR1_HDDIR_Msk                       /*!<Rx/Tx direction at Half-duplex mode */
#define SPI_CR1_SSI_Pos                     (12U)
#define SPI_CR1_SSI_Msk                     (0x1UL << SPI_CR1_SSI_Pos)              /*!< 0x00001000 */
#define SPI_CR1_SSI                         SPI_CR1_SSI_Msk                         /*!<Internal SS signal input level */
#define SPI_CR1_CRC33_17_Pos                (13U)
#define SPI_CR1_CRC33_17_Msk                (0x1UL << SPI_CR1_CRC33_17_Pos)         /*!< 0x00002000 */
#define SPI_CR1_CRC33_17                    SPI_CR1_CRC33_17_Msk                    /*!<32-bit CRC polynomial configuration */
#define SPI_CR1_RCRCINI_Pos                 (14U)
#define SPI_CR1_RCRCINI_Msk                 (0x1UL << SPI_CR1_RCRCINI_Pos)          /*!< 0x00004000 */
#define SPI_CR1_RCRCINI                     SPI_CR1_RCRCINI_Msk                     /*!<CRC calculation initialization pattern control for receiver */
#define SPI_CR1_TCRCINI_Pos                 (15U)
#define SPI_CR1_TCRCINI_Msk                 (0x1UL << SPI_CR1_TCRCINI_Pos)          /*!< 0x00008000 */
#define SPI_CR1_TCRCINI                     SPI_CR1_TCRCINI_Msk                     /*!<CRC calculation initialization pattern control for transmitter */
#define SPI_CR1_IOLOCK_Pos                  (16U)
#define SPI_CR1_IOLOCK_Msk                  (0x1UL << SPI_CR1_IOLOCK_Pos)           /*!< 0x00010000 */
#define SPI_CR1_IOLOCK                      SPI_CR1_IOLOCK_Msk                      /*!<Locking the AF configuration of associated IOs */

